{
  "architectures": [
    "LLaDA2MoeModelLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_llada2_moe.LLaDA2MoeConfig",
    "AutoModel": "modeling_llada2_moe.LLaDA2MoeModel",
    "AutoModelForCausalLM": "modeling_llada2_moe.LLaDA2MoeModelLM"
  },
  "dtype": "bfloat16",
  "embedding_dropout": 0.0,
  "first_k_dense_replace": 1,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "llada2_moe",
  "moe_intermediate_size": 512,
  "moe_router_enable_expert_bias": true,
  "n_group": 8,
  "norm_head": false,
  "norm_softmax": false,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "num_experts": 256,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 20,
  "num_key_value_heads": 4,
  "num_shared_experts": 1,
  "output_dropout": 0.0,
  "output_router_logits": false,
  "pad_token_id": 156892,
  "partial_rotary_factor": 0.5,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 600000,
  "rotary_dim": 64,
  "routed_scaling_factor": 2.5,
  "router_dtype": "fp32",
  "score_function": "sigmoid",
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "topk_group": 4,
  "transformers_version": "4.57.1",
  "use_bias": false,
  "use_cache": false,
  "use_qkv_bias": false,
  "use_rmsnorm": true,
  "use_sliding_window": false,
  "using_split_qkv_in_self_attention": false,
  "vocab_size": 157184
}
